# FluidTemperatureSetIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FluidTemperatureSetIterator Properties
FluidTemperatureSetIterator Class See Also
---
The FluidTemperatureSetIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Gets the item at the current position of the iterator. |
| CurrentObject |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FluidTemperatureSetIterator Class
Autodesk.Revit.DB.Plumbing Namespace